<template lang="pug">
    
    AdvicesSlider(:slides="slides")

</template>

<script>
import AdvicesSlider from "@/components/Sliders/Advices.vue";

export default {
    data () {
        return {
            slides: [
                {
                    text: "При написании отзыва старайтесь использовать полезную информацию: в каком регионе/городе Вы пользовались услугами мастера, название салона/студии, стиль, длительность сеанса, место работы на теле, стоимость, общие впечатления о сервисе и татуировщике, возможные пожелания/замечания.",
                },
                {
                    text: "Значимость этих проблем настолько очевидна, что сложившаяся структура организации способствует подготовки и реализации новых предложений. Задача организации, в особенности же начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании модели развития.",
                },
                {
                    text: "Разнообразный и богатый опыт реализация намеченных плановых заданий требуют от нас анализа новых предложений. Не следует, однако забывать, что укрепление и развитие структуры позволяет оценить значение новых предложений.",
                },
            ]
        }
    },
    components: {
        AdvicesSlider,
    },
}
</script>

<style lang="scss">
    
</style>